app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-02-07 07:27:42', 'Hello, World!', 'A new beginning ...', '2009-02-07 07:27:42')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 6)
UPDATE "posts" SET "updated_at" = '2009-02-08 16:10:20', "title" = 'Regular Expressions for Bible References' WHERE "id" = 6
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])