app/controllers/users_controller.rb

INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES(NULL, '2009-02-07 07:25:09', '52d43551a908d93a204c63908f43918420aea455d3b09eca51895ca7724c6d6abe34b9892d54953c1356278bb3510986595edf5b7bc0a62a736b3eabc8a783c1', '2009-02-07 07:25:09', NULL, 'd1439f1a01e4ddd5017b7d4bba6d96b451e7b2df9eac62858149e49cbf9742851fc958210ec56214b027356549d99b2a33fecc65d7f99ac7f655f3920a43dcde', NULL, 'bd8df7b03f98139c445c52a36be114815da0bf7169fb0b9846fff41cf6d11103ef1555f788c6c79e935fa801bb32e6e0c30ee2fa2f5470b77979fcb6235abf1b', NULL, NULL, 'daniel', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save